docs/site/dean09_histor_view_comput_music_techn.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-05-29 Wed 22:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>dean09_histor_view_comput_music_techn</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../style.css" type="text/css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">dean09_histor_view_comput_music_techn</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgcbe4974">page 13</a></li>
<li><a href="#orgc1471de">page 16</a></li>
<li><a href="#orgef832d5">page 18</a></li>
<li><a href="#org8a63c22">page 19-20</a></li>
<li><a href="#orgccd9af1">page 21</a></li>
<li><a href="#org49cac6d">page 24</a></li>
<li><a href="#orgc23c888">page 25</a></li>
<li><a href="#orgfb1dc2b">page 29</a></li>
<li><a href="#org4ad7cb9">page 31</a></li>
<li><a href="#orgfc1d7a4">page 32</a></li>
<li><a href="#org5920714">page 40</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgcbe4974" class="outline-2">
<h2 id="orgcbe4974">page 13</h2>
<div class="outline-text-2" id="text-orgcbe4974">
<p>
The liberation of the composer from the constraints of of performers' abilities is a central theme in music technology, especially in computer music.
</p>
</div>
</div>
<div id="outline-container-orgc1471de" class="outline-2">
<h2 id="orgc1471de">page 16</h2>
<div class="outline-text-2" id="text-orgc1471de">
<p>
Synthesizers and audio recording disintermediate performers. Tape music also disintermediates the musical instrument.
</p>
</div>
</div>
<div id="outline-container-orgef832d5" class="outline-2">
<h2 id="orgef832d5">page 18</h2>
<div class="outline-text-2" id="text-orgef832d5">
<p>
The computer completed the disjunction from the body that began with the instrument.
</p>
</div>
</div>
<div id="outline-container-org8a63c22" class="outline-2">
<h2 id="org8a63c22">page 19-20</h2>
<div class="outline-text-2" id="text-org8a63c22">
<p>
Overview of the history of digital sound synthesis
Digital recording allowed the musique concrete skills to transfer to the computer studio.
</p>
</div>
</div>
<div id="outline-container-orgccd9af1" class="outline-2">
<h2 id="orgccd9af1">page 21</h2>
<div class="outline-text-2" id="text-orgccd9af1">
<p>
The computer allowed unprecedented control over pitch, timbre, spaital location, textural complexity, precise rhythms, etc.
</p>
</div>
</div>
<div id="outline-container-org49cac6d" class="outline-2">
<h2 id="org49cac6d">page 24</h2>
<div class="outline-text-2" id="text-org49cac6d">
<p>
Computer music history is more or less divided in half by the advent of MIDI, personal computers, and the Yamaha DX7 synthesizer; all happening within months of each other
</p>
</div>
</div>
<div id="outline-container-orgc23c888" class="outline-2">
<h2 id="orgc23c888">page 25</h2>
<div class="outline-text-2" id="text-orgc23c888">
<p>
Music-N langauges some of the first programming languages for music, all text based
</p>
</div>
</div>
<div id="outline-container-orgfb1dc2b" class="outline-2">
<h2 id="orgfb1dc2b">page 29</h2>
<div class="outline-text-2" id="text-orgfb1dc2b">
<p>
The first half of computer music featured the composer, the second half is the advent of the performer
</p>
</div>
</div>
<div id="outline-container-org4ad7cb9" class="outline-2">
<h2 id="org4ad7cb9">page 31</h2>
<div class="outline-text-2" id="text-org4ad7cb9">
<p>
Audiences can also become part of the performance
</p>
</div>
</div>
<div id="outline-container-orgfc1d7a4" class="outline-2">
<h2 id="orgfc1d7a4">page 32</h2>
<div class="outline-text-2" id="text-orgfc1d7a4">
<p>
Composer releasing control is precedented by figured bass, or aleatoric computer composition
</p>

<p>
Freedom for performers of one-to-many relationship with gesture and sound
</p>
</div>
</div>
<div id="outline-container-org5920714" class="outline-2">
<h2 id="org5920714">page 40</h2>
<div class="outline-text-2" id="text-org5920714">
<p>
<code>Paradoxically, the ability of the computer to mimic, transform, and in some respects exceed conventional human music-making could serve to refocus humans' concern on the corporeal and emotional aspects of music -- bringing to a full circle the process of disjunciton that began with the externalization of sound production from the body.</code>
</p>

<p>
<code>In summary, the historical development of music technology can be viewed as human creativity's drawing on the primal act of singing and proliferating it out from the body through a multitude of ingenious devices. ... The resulting profusion of potentail physical and virtual interconnections holds the seeds of countless sonic manifestations, which colletively constitute the musically possible. From these, it is the role of the artist to extract the musically meaningful.</code>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p><a href="sitemap.html">Site Map</a></p>
</div>
</body>
</html>
